tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "hudochenkov/sshpass"
tap "nativeos/i386-elf-toolchain"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# All in one for **env
brew "anyenv"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Load/unload environment variables based on $PWD
brew "direnv"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Compression/decompression library aiming for high speed
brew "snappy"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for processing command-line flags
brew "gflags"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Framework for layout and rendering of i18n text
brew "pango"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Istio configuration command-line utility
brew "istioctl"
# Extendable open source continuous integration server
brew "jenkins"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Programming language designed to minimize programmer experience
brew "kite", link: false
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# GNOME XML library
brew "libxml2"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Run a Kubernetes cluster locally
brew "minikube"
# Cross platform, open source .NET development framework
brew "mono"
# Tools for manipulating MSDOS files
brew "mtools"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Development kit for the Java programming language
brew "openjdk"
# Highly capable, feature-rich programming language
brew "perl"
# Show ps output as a tree
brew "pstree"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Emulator for x86 and PowerPC
brew "qemu"
# Lisp installer and launcher for major environments
brew "roswell"
# Build tool for Scala projects
brew "sbt"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
brew "hudochenkov/sshpass/sshpass"
# GNU Binutils targetting i386-elf
brew "nativeos/i386-elf-toolchain/i386-elf-binutils"
# GNU Compiler Collection targetting i386-elf
brew "nativeos/i386-elf-toolchain/i386-elf-gcc"
cask "adoptopenjdk"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Mobile gaming platform
cask "bluestacks"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Trains AIs to understand and translate texts
cask "deepl"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Tool for using an iPad as a second display
cask "duet"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-ricty-diminished"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
cask "java"
# Keyboard customizer
cask "karabiner-elements"
cask "kite"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Research management tool
cask "mendeley-reference-manager"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
cask "microsoft-teams"
cask "miro"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Allows users with an iSight (or compatible) camera to read QR codes
cask "qr-journal"
# Environment for statistical computing and graphics
cask "r"
# Data science software focusing on R and Python
cask "rstudio"
# MySQL/MariaDB database management platform
cask "sequel-pro"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Native GUI tool for relational databases
cask "tableplus"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Development environment
cask "vagrant"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "wkhtmltopdf"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
